app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new
    @school_class.title = params[:school_class][:title]
    @school_class.room_number = params[:school_class][:room_number]
    @school_class.save
---
INSERT INTO "school_classes" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-09-04 07:08:57.892240"], ["updated_at", "2021-09-04 07:08:57.892240"]]